[
  {
    "id": "1",
    "name": "Computer Networks",
    "description": "An introduction to the basics of transport connections and sessions. The protocol hierarchy, design issues in transport and session layer protocol, end-to-end protocols, message handling protocols, terminal and file transfer protocols, Internet TCP/IP protocols. End to end data networks, congestion control networks, wireless networks, mobile computing, high speed networks. Concurrent programming, data link layer, framing and error control, media access control. Models of distributed computation, management and resource control of networks and distributed operating systems, distributed file systems, caching scheduling, process migration. Fault tolerance, network security and privacy, algorithm for deadlock detection. Synchronization and concurrency control in distributed systems. The course includes a compulsory 3-hour laboratory work each week if the student wishes to obtain CCNA certification. Otherwise the course includes a compulsory 3-hour laboratory work alternate week.",
    "credit": 3,
    "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTIrkaroVKgOcwmZ5MF36NpefXtj7RFkKP91w&usqp=CAU",
    "book": "Computer Networks and Open System",
    "author": "F. Hallsall.",
    "price": "105 $"
  },
  {
    "id": "2",
    "name": "Machine Learning",
    "description": "Introduction to machine learning; Supervised and reinforcement learning; Unsupervised learning algorithms; Attribute based and relational supervised learning algorithms; Neural network based learning algorithms; Genetic algorithm and genetic programming; Reinforcement learning algorithms; Computational learning theory.",
    "credit": 3.5,
    "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQcLaXTxLL-SkJ4INakh_8OeuNANRANpIqRvQ&usqp=CAU",
    "book": "The Machine Learning Approach",
    "author": "Pierre Baldi.",
    "price": "130$"
  },
  {
    "id": "3",
    "name": "Data Mining",
    "description": "Data Mining studies algorithms and computational paradigms that allow computers to find patterns and regularities in databases, perform prediction and forecasting, and generally improve their performance through interaction with data. It is currently regarded as the key element of a more general process called Knowledge Discovery that deals with extracting useful knowledge from raw data. The knowledge discovery process includes data selection, cleaning, coding, using different statistical and machine learning techniques, and visualization of the generated structures. The course will cover all these issues and will illustrate the whole process by examples. Special emphasis will be give to the Machine Learning methods as they provide the real knowledge discovery tools. Important related technologies, as data warehousing and on-line analytical processing (OLAP) will be also discussed. The students will use recent Data Mining software. Enrollment in this course is limited to 15 students.",
    "credit": 3,
    "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSQnU3HkXBQDlQ7dmSk0V0yB_gZIm2nHG_zMQ&usqp=CAU",
    "book": "Introduction to Data Minings",
    "author": "Md. Steinbach & Kumar",
    "price": "105 $"
  },
  {
    "id": "4",
    "name": "Network Programming",
    "description": "This course is designed to extend students' knowledge and practice in analysis and design of computer networks by focusing on computer network programming. It includes introduction, Internet Address, URLs and URis, HTTP, URLConnections, Socket Programming, IP Multicast and RMI. The JAVA programming language will be used throughout the course. It does not entirely focus on theoretical concept but also strongly focuses on practical skill based knowledge.",
    "credit": 4,
    "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTpX5G56hE1BfMf5SnislKlgLxMH0f2va1gtg&usqp=CAU",
    "book": "Advanced Programming in the UNIX(R) Environment",
    "author": "W. Richard Stevens.",
    "price": "100 $"
  },
  {
    "id": "5",
    "name": "Operating System",
    "description": "Principles of operating systems: design objects; sequential process; concurrent processes, functional mutual exclusion, processor co-operation and deadlocks, management. Control and scheduling of large information processing systems. Dispatching processor access methods, job control languages memory addressing, paging and store multiplexing, and time sharing, batch processing. Scheduling algorithms, file systems, and security; semaphores and critical sections, device drivers, multiprocessing, sharing, design and implementation methodology, performance evaluation and case studies. The course includes a compulsory 3 hour laboratory work each week.",
    "credit": 2,
    "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSkVW8BLMd_lX_DsD1pvK2q2Bc862vdBfy4Iw&usqp=CAU",
    "book": "Computer Networks: Protocols Standard and Interfaces",
    "author": "U. D. Black.",
    "price": "120 $"
  },
  {
    "id": "6",
    "name": "Bio-Informatics",
    "description": "Bioinformatics is a popular science discipline that is a combination of studies related to Biology, Computer Languages, Data Science, and Basic Engineering. Both bachelor-level and master-level courses are available in Bioinformatics. For instance, MSc Bioinformatics is a two-year course and its curriculum is divided into four semesters. BSc Bioinformatics is a three-year course and its curriculum is divided into six semesters. BTech and MTech courses are also available in Bioinformatics, which are four and two-year courses, respectively. The students prefer to take up Bioinformatics courses, as it helps them to pursue a career in Bio-Analytics, Data Analytics, Proteomics, Information Technology, Pharmacology, and other areas.",
    "credit": 3,
    "img": "https://academic.oup.com/data/sitebuilderassetsoriginals/live/images/bioinformatics/bioinformatics_ogimage.png",
    "book": "Bioinformatics for Dummies",
    "author": "Claverie, J. M. and Notredame C.",
    "price": "95 $"
  }
]
